name: "CaffeNet"
layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  include { phase: TRAIN }
  image_data_param {
    source: "/data/raid_ssd/Datasets/FlickrLogos_v3/train/filelist_abs.txt"
    batch_size: 100
    new_height: 128
    new_width: 128
  }
  augmented_param {
    num_rotations_img: 10
    min_rotation_angle: 0
    max_rotation_angle: 5
  }
}
